cases/openfoam.org/complexMeshMotion/system/fvConstraints
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvConstraint;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


// That the fvConstraints work properly, you need the commit
// 987d5906ef2e29c711d98b15ff400e5dedcf4500
// otherwise, the fvOptions function does not work

/*
scalarConstraint
{
    type            fixedValueConstraint;

    selectionMode   cellZone;
    cellZone        scalarZone;

    fieldValues
    {
        S   1;
    }
}
*/

// ************************************************************************* //
